-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 11 2022 г., 13:28
-- Версия сервера: 10.1.48-MariaDB
-- Версия PHP: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `phpshop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `book_id` int(11) DEFAULT NULL,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `text` longtext COLLATE utf8mb4_unicode_ci,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `updated_at` date NOT NULL,
  `created_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `book_id`, `name`, `text`, `image`, `updated_at`, `created_at`) VALUES
(58, 63, 'egor8765', 'Отличная книга!', 'Bl-iHASDuDU.jpg', '0000-00-00', '0000-00-00'),
(59, 64, 'egor8765', '1234', 'sobaka-drug-xatiko-glaza.jpg', '2022-05-10', '2022-05-10'),
(60, 64, 'egor8765', '1354', 'sobaka-drug-xatiko-glaza.jpg', '2022-05-10', '2022-05-10'),
(61, 64, 'egor8765', '1354', 'sobaka-drug-xatiko-glaza.jpg', '2022-05-10', '2022-05-10'),
(62, 64, 'egor8765', '5454', 'sobaka-drug-xatiko-glaza.jpg', '2022-05-10', '2022-05-10');

-- --------------------------------------------------------

--
-- Структура таблицы `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `price` float NOT NULL,
  `author` varchar(32) NOT NULL,
  `description` text NOT NULL,
  `genre` varchar(255) NOT NULL,
  `rating_amount` float NOT NULL,
  `rating_count` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `product`
--

INSERT INTO `product` (`id`, `name`, `image`, `price`, `author`, `description`, `genre`, `rating_amount`, `rating_count`) VALUES
(63, 'Крестный отец', 'krestn.jpg', 767, 'Марио Пьюзо', '\"Крестный отец\" - классический роман о жизни одного из могущественных преступных синдикатов Америки - мафиозном клане дона Корлеоне. Написанная с потрясающей достоверностью книга позволяет читателю без риска для жизни заглянуть в святая святых мафии.\r\nРоман Пьюзо лег в основу знаменитого фильма, снятого Фрэнсисом Фордом Копполой. Эта картина получила девятнадцать различных наград и по праву считается одной из лучших в мировом кинематографе.', 'drama', 0, 0),
(64, 'Я был секретарем сталина', 'stal.jpg', 544, ' Борис Бажанов', '\"... Мои воспоминания относятся, главным образом, к тому периоду, когда я был помощником Генерального секретаря ЦК ВКП (Центрального Комитета Всесоюзной Коммунистической Партии) Сталина и секретарём Политбюро ЦК ВКП. Я был назначен на эти должности 9 августа 1923 года. Став антикоммунистом, я бежал из Советской России 1 января 1928 года через персидскую границу\"\".\r\nС 1923 по 1928 год Борис Бажанов являлся личным секретарем Сталина, имел доступ к самым секретным документам ЦК ВКП(б). После побега из Советского Союза он опубликовал во Франции эти воспоминания, ярко характеризующие личность Сталина, его методы достижения власти и политические интриги в Кремле.', 'biography', 0, 0),
(73, 'Преступление и наказание', 'prestupl.png', 451, 'Федор Михайлович Достоевский', '\"Преступление и наказание\" - роман об одном преступлении. Двойное убийство, совершенное бедным студентом из-за денег. Трудно найти фабулу проще, но интеллектуальное и душевное потрясение, которое производит роман, - неизгладимо. А вопрос, который главный герой поставил перед собой для решения: \"Тварь ли я дрожащая или право имею?\" - ужасает. Бездны падения исследует писатель для того, чтобы подняться на вершины духа.', 'novel', 5, 1),
(74, 'PHP 7 в подлиннике', 'php7.png', 1304, 'Дмитрий Котеров, Игорь Симдянов', '\"Рассмотрены основы языка PHP и его рабочего окружения в Windows, Mac OS X и Linux.\r\nОтражены радикальные изменения в языке PHP, произошедшие с момента выхода предыдущего издания: трейты, пространство имен, анонимные функции, замыкания, элементы строгой типизации, генераторы, встроенный Web-сервер и многие другие возможности. Приведено описание синтаксиса PHP 7, а также функций для работы с массивами, файлами, СУБД MySQL, memcached, регулярными выражениями, графическими примитивами, почтой, сессиями и т. д. Особое внимание уделено рабочему окружению: сборке PHP-FPM и Web-сервера nginx, СУБД MySQL, протоколу SSH, виртуальным машинам VirtualBox и менеджеру виртуальных машин Vagrant. ', 'guide', 5, 1),
(75, 'Понимание SQL', 'sql.png', 850, 'Мартин Грубер', '\"ПОНИМАНИЕ SQL\" — это полный учебник по программированию на Структурированном Языке Запросов, написанный специально для тех, кто будет использовать SQL в процессе работы. Даже если это ваш первый опыт с компьютерами или управлением базами данных, книга \"ПОНИМАНИЕ SQL\" очень быстро научит вас свободно работать с реальной SQL, использованию простых запросов, а также снабдит вас ясными понятиями об автоматизированном управлении базой данных. Книга даст вам краткое, удобное в чтении введение в реляционные базы данных. Предоставит вам обучающие программы, чтобы, овладевая командами SQL шаг за шагом, помочь вам узнать, как извлекать и обрабатывать информацию, содержащуюся в таблицах данных.', 'guide', 5, 1),
(76, 'Мизери', 'misery.png', 344, 'Стивен Кинг', 'Может ли спасение от верной гибели обернуться таким кошмаром, что даже смерть покажется милосердным даром судьбы?\r\nМожет. Ибо это произошло с Полом Шелдоном, автором бесконечного сериала книг о злоключениях Мизери. Раненый писатель оказался в руках Энни Уилкс - женщины, потерявшей рассудок на почве его романов. Уединенный домик одержимой бесами фурии превратился в камеру пыток, а существование Пола - в ад, полный боли и ужаса.', 'drama', 0, 0),
(77, 'Властелин колец', 'lord.jpg', 1450, 'Толкин Джон Рональд Руэл', 'Джон Рональд Руэл Толкин (3.01.1892 - 2.09.1973) - писатель, поэт, филолог, профессор Оксфордского университета, родоначальник современной фэнтези. В 1937 году был написан \"Хоббит\", а в середине 1950-х годов увидели свет три книги \"Властелина колец\", повествующие о Средиземье - мире, населенном представителями волшебных рас со сложной культурой, историей и мифологией.\r\nСуществует свыше десятка переводов трилогии на русский язык. В данное издание вошел перевод В. Каррика, М. Каменкович', 'fantasy', 0, 0),
(78, 'Заводной апельсин', 'apels.jpg', 351, 'Энтони Берджесс', '\"Заводной апельсин\" - литературный парадокс ХХ столетия. Продолжая футуристические традиции в литературе, экспериментируя с языком, на котором говорит рубежное поколение malltshipalltshikov и kisok \"надсатых\", Энтони Бёрджесс создает роман, признанный классикой современной литературы.\r\nУмный, жестокий, харизматичный антигерой Алекс, лидер уличной банды, проповедуя насилие как высокое искусство жизни, как род наслаждения, попадает в железные тиски новейшей государственной программы по перевоспитанию преступников и сам становится жертвой насилия. Можно ли спасти мир от зла, лишая человека воли совершать поступки и превращая его в \"заводной апельсин\"? Этот вопрос сегодня актуален так же, как и вчера, и вопрос этот автор задает читателю.\r\nПодробнее: https://www.labirint.ru/books/420102/', 'fantastic', 0, 0),
(79, 'Солярис', 'solyaris.jpg', 338, 'Станислав Лем', '\"Солярис\" - бесспорная вершина творчества Станислава Лема, произведение, повлиявшее на развитие научной фантастики XX века, в том числе и на русскую фантастику. Роман дважды экранизирован, по нему были поставлены радиопьесы, спектакли - и даже балет!\r\nИтак, что же такое - Солярис? Бескрайний мыслящий океан, преследующий непонятные человеку цели, тончайший камертон, преобразующий людские чувства в материальную форму? Воплощенный кошмар психолога или духовный целитель? Со дня публикации книги прошло больше 50 лет, а ее читатели все так же продолжают задаваться вопросами, ответы на которые невозможно получить, не заглянув в свое собственное сердце.', 'fantastic', 5, 1),
(80, 'Экспедиция \"Тяготение\"', 'tyagot.jpg', 243, 'Хол Клемент', 'Хол Клемент (1922-2003) – американский писатель-фантаст, ярчайший представитель «твердой» НФ, прославившийся подробным «конструированием» планет с необычными свойствами гравитации, с невероятным климатом, флорой и фауной. Основанные на современных постулатах астрономии, физики и биологии, его фантастические миры стали настоящим примером профессионализма и мастерства для сотен собратьев по перу.', 'fantastic', 4, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `product_order`
--

CREATE TABLE `product_order` (
  `id` int(11) NOT NULL,
  `user_name` varchar(255) NOT NULL,
  `user_phone` varchar(255) NOT NULL,
  `user_comment` text NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `products` text NOT NULL,
  `status` int(11) NOT NULL DEFAULT '1',
  `created_at` date NOT NULL,
  `updated_at` date NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `product_order`
--

INSERT INTO `product_order` (`id`, `user_name`, `user_phone`, `user_comment`, `user_id`, `date`, `products`, `status`, `created_at`, `updated_at`) VALUES
(88, 'Егор', '79204516092', '1234', 11, '2022-05-10 15:17:01', '{\"63\":1,\"64\":1}', 1, '2022-05-10', '2022-05-10');

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(12) NOT NULL,
  `image` varchar(255) NOT NULL,
  `updated_at` date NOT NULL,
  `created_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `name`, `email`, `password`, `role`, `image`, `updated_at`, `created_at`) VALUES
(11, 'egor8765', 'egor8765@mail.ru', '123456', 'admin', 'sobaka-drug-xatiko-glaza.jpg', '2022-05-10', '0000-00-00'),
(15, 'feda993', 'feda9938765@yandex.ru', '123456', 'admin', '9975982_p1070347.jpg', '0000-00-00', '0000-00-00'),
(16, 'a9938765', 'egor81765@mail.ru', '123456', 'admin', 'unnamed.jpg', '0000-00-00', '0000-00-00'),
(17, 'Jane030482', 'alex@mail.com', '123456', 'admin', 'unnamed.jpg', '0000-00-00', '0000-00-00'),
(18, 'a99387654', 'egor87654@mail.ru', '123456', 'admin', 'unnamed.jpg', '0000-00-00', '0000-00-00'),
(19, 'a993876543', 'egor876541@mail.ru', '123456', 'admin', 'unnamed.jpg', '0000-00-00', '0000-00-00'),
(20, 'a9938765433', 'egor8765411@mail.ru', '123456', 'admin', 'unnamed.jpg', '0000-00-00', '0000-00-00'),
(21, 'a99387654333', 'egor87654111@mail.ru', '123456', 'admin', 'unnamed.jpg', '0000-00-00', '0000-00-00'),
(24, 'egor8764', 'Egor9943@yandex.ru', '123456', 'user', '', '2022-05-06', '2022-05-06'),
(25, 'egor8763', 'Egor9944@yandex.ru', '123456', 'user', '', '2022-05-06', '2022-05-06'),
(26, 'a9938764', 'altlol33@mail.ru', '123456', 'user', '', '2022-05-06', '2022-05-06'),
(29, 'dghdfhg', 'altlo33l1@mail.ru', '123456', 'user', '', '2022-05-06', '2022-05-06');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `product_order`
--
ALTER TABLE `product_order`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `name` (`name`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=63;

--
-- AUTO_INCREMENT для таблицы `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT для таблицы `product_order`
--
ALTER TABLE `product_order`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;

--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
