-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 02 2022 г., 15:52
-- Версия сервера: 10.1.48-MariaDB
-- Версия PHP: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `phpshop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `product_id` int(11) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `text` longtext COLLATE utf8mb4_unicode_ci,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `product_id`, `user_id`, `text`, `created_at`, `updated_at`) VALUES
(80, 63, 39, 'Отличная книга!', '2022-06-02 15:49:59', '2022-06-02 15:49:59');

-- --------------------------------------------------------

--
-- Структура таблицы `genres`
--

CREATE TABLE `genres` (
  `id` int(11) NOT NULL,
  `name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `genres`
--

INSERT INTO `genres` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'Драма', '2022-05-12 12:42:28', '2022-05-12 12:42:55'),
(2, 'Новелла', '2022-05-12 12:42:28', '2022-05-12 12:42:55'),
(3, 'Биография', '2022-05-12 12:42:28', '2022-05-12 12:42:55'),
(4, 'Руководство', '2022-05-12 12:42:28', '2022-05-12 12:42:55'),
(5, 'Фэнтэзи', '2022-05-12 12:42:28', '2022-05-12 12:42:55'),
(6, 'Фантастика', '2022-05-12 12:42:28', '2022-05-12 12:42:55'),
(7, 'Преступление', '2022-05-12 12:42:28', '2022-05-12 12:42:55');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `user_name` varchar(255) NOT NULL,
  `user_phone` varchar(255) NOT NULL,
  `user_comment` text NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `products` text NOT NULL,
  `status` int(11) NOT NULL DEFAULT '1',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `user_name`, `user_phone`, `user_comment`, `user_id`, `products`, `status`, `created_at`, `updated_at`) VALUES
(98, 'Олег Тестович', '79204516092', '1234', 0, '{\"74\":1,\"73\":1}', 1, '2022-05-22 16:54:21', '2022-05-22 16:54:21'),
(97, 'Олег Тестович', '79204516092', '1234', 36, '{\"64\":1,\"73\":1,\"74\":1}', 1, '2022-05-12 17:22:27', '2022-05-12 17:22:27'),
(96, 'Егор', '79204516092', '1234', 35, '{\"73\":1,\"74\":1,\"64\":1}', 1, '2022-05-12 17:18:48', '2022-05-12 17:18:48'),
(95, 'Тест Тестович', '79204516092', '1234', 35, '{\"74\":1,\"73\":1,\"64\":1}', 1, '2022-05-12 17:18:29', '2022-05-12 17:18:29'),
(94, 'Егор', '79204516092', '1234', 35, '{\"74\":1,\"73\":1,\"64\":1}', 1, '2022-05-12 17:17:14', '2022-05-12 17:17:14');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `price` float NOT NULL,
  `author` varchar(32) NOT NULL,
  `description` text NOT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `image`, `price`, `author`, `description`, `created_at`, `updated_at`) VALUES
(63, 'Крестный отец', 'krestn.jpg', 767, 'Марио Пьюзо', '\"Крестный отец\" - классический роман о жизни одного из могущественных преступных синдикатов Америки - мафиозном клане дона Корлеоне. Написанная с потрясающей достоверностью книга позволяет читателю без риска для жизни заглянуть в святая святых мафии.\r\nРоман Пьюзо лег в основу знаменитого фильма, снятого Фрэнсисом Фордом Копполой. Эта картина получила девятнадцать различных наград и по праву считается одной из лучших в мировом кинематографе.', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(64, 'Я был секретарем сталина', 'stal.jpg', 544, ' Борис Бажанов', '\"... Мои воспоминания относятся, главным образом, к тому периоду, когда я был помощником Генерального секретаря ЦК ВКП (Центрального Комитета Всесоюзной Коммунистической Партии) Сталина и секретарём Политбюро ЦК ВКП. Я был назначен на эти должности 9 августа 1923 года. Став антикоммунистом, я бежал из Советской России 1 января 1928 года через персидскую границу\"\".\r\nС 1923 по 1928 год Борис Бажанов являлся личным секретарем Сталина, имел доступ к самым секретным документам ЦК ВКП(б). После побега из Советского Союза он опубликовал во Франции эти воспоминания, ярко характеризующие личность Сталина, его методы достижения власти и политические интриги в Кремле.', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(73, 'Преступление и наказание', 'prestupl.png', 451, 'Федор Михайлович Достоевский', '\"Преступление и наказание\" - роман об одном преступлении. Двойное убийство, совершенное бедным студентом из-за денег. Трудно найти фабулу проще, но интеллектуальное и душевное потрясение, которое производит роман, - неизгладимо. А вопрос, который главный герой поставил перед собой для решения: \"Тварь ли я дрожащая или право имею?\" - ужасает. Бездны падения исследует писатель для того, чтобы подняться на вершины духа.', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(74, 'PHP 7 в подлиннике', 'php7.png', 1304, 'Дмитрий Котеров, Игорь Симдянов', '\"Рассмотрены основы языка PHP и его рабочего окружения в Windows, Mac OS X и Linux.\r\nОтражены радикальные изменения в языке PHP, произошедшие с момента выхода предыдущего издания: трейты, пространство имен, анонимные функции, замыкания, элементы строгой типизации, генераторы, встроенный Web-сервер и многие другие возможности. Приведено описание синтаксиса PHP 7, а также функций для работы с массивами, файлами, СУБД MySQL, memcached, регулярными выражениями, графическими примитивами, почтой, сессиями и т. д. Особое внимание уделено рабочему окружению: сборке PHP-FPM и Web-сервера nginx, СУБД MySQL, протоколу SSH, виртуальным машинам VirtualBox и менеджеру виртуальных машин Vagrant. ', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(75, 'Понимание SQL', 'sql.png', 850, 'Мартин Грубер', '\"ПОНИМАНИЕ SQL\" — это полный учебник по программированию на Структурированном Языке Запросов, написанный специально для тех, кто будет использовать SQL в процессе работы. Даже если это ваш первый опыт с компьютерами или управлением базами данных, книга \"ПОНИМАНИЕ SQL\" очень быстро научит вас свободно работать с реальной SQL, использованию простых запросов, а также снабдит вас ясными понятиями об автоматизированном управлении базой данных. Книга даст вам краткое, удобное в чтении введение в реляционные базы данных. Предоставит вам обучающие программы, чтобы, овладевая командами SQL шаг за шагом, помочь вам узнать, как извлекать и обрабатывать информацию, содержащуюся в таблицах данных.', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(76, 'Мизери', 'misery.png', 344, 'Стивен Кинг', 'Может ли спасение от верной гибели обернуться таким кошмаром, что даже смерть покажется милосердным даром судьбы?\r\nМожет. Ибо это произошло с Полом Шелдоном, автором бесконечного сериала книг о злоключениях Мизери. Раненый писатель оказался в руках Энни Уилкс - женщины, потерявшей рассудок на почве его романов. Уединенный домик одержимой бесами фурии превратился в камеру пыток, а существование Пола - в ад, полный боли и ужаса.', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(77, 'Властелин колец', 'lord.jpg', 1450, 'Толкин Джон Рональд Руэл', 'Джон Рональд Руэл Толкин (3.01.1892 - 2.09.1973) - писатель, поэт, филолог, профессор Оксфордского университета, родоначальник современной фэнтези. В 1937 году был написан \"Хоббит\", а в середине 1950-х годов увидели свет три книги \"Властелина колец\", повествующие о Средиземье - мире, населенном представителями волшебных рас со сложной культурой, историей и мифологией.\r\nСуществует свыше десятка переводов трилогии на русский язык. В данное издание вошел перевод В. Каррика, М. Каменкович', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(78, 'Заводной апельсин', 'apels.jpg', 351, 'Энтони Берджесс', '\"Заводной апельсин\" - литературный парадокс ХХ столетия. Продолжая футуристические традиции в литературе, экспериментируя с языком, на котором говорит рубежное поколение malltshipalltshikov и kisok \"надсатых\", Энтони Бёрджесс создает роман, признанный классикой современной литературы.\r\nУмный, жестокий, харизматичный антигерой Алекс, лидер уличной банды, проповедуя насилие как высокое искусство жизни, как род наслаждения, попадает в железные тиски новейшей государственной программы по перевоспитанию преступников и сам становится жертвой насилия. Можно ли спасти мир от зла, лишая человека воли совершать поступки и превращая его в \"заводной апельсин\"? Этот вопрос сегодня актуален так же, как и вчера, и вопрос этот автор задает читателю.\r\nПодробнее: https://www.labirint.ru/books/420102/', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(79, 'Солярис', 'solyaris.jpg', 338, 'Станислав Лем', '\"Солярис\" - бесспорная вершина творчества Станислава Лема, произведение, повлиявшее на развитие научной фантастики XX века, в том числе и на русскую фантастику. Роман дважды экранизирован, по нему были поставлены радиопьесы, спектакли - и даже балет!\r\nИтак, что же такое - Солярис? Бескрайний мыслящий океан, преследующий непонятные человеку цели, тончайший камертон, преобразующий людские чувства в материальную форму? Воплощенный кошмар психолога или духовный целитель? Со дня публикации книги прошло больше 50 лет, а ее читатели все так же продолжают задаваться вопросами, ответы на которые невозможно получить, не заглянув в свое собственное сердце.', '2022-05-12 12:57:55', '2022-05-12 12:58:18'),
(80, 'Экспедиция \"Тяготение\"', 'tyagot.jpg', 243, 'Хол Клемент', 'Хол Клемент (1922-2003) – американский писатель-фантаст, ярчайший представитель «твердой» НФ, прославившийся подробным «конструированием» планет с необычными свойствами гравитации, с невероятным климатом, флорой и фауной. Основанные на современных постулатах астрономии, физики и биологии, его фантастические миры стали настоящим примером профессионализма и мастерства для сотен собратьев по перу.', '2022-05-12 12:57:55', '2022-05-12 12:58:18');

-- --------------------------------------------------------

--
-- Структура таблицы `products-genres`
--

CREATE TABLE `products-genres` (
  `id` int(10) NOT NULL,
  `id_product` int(11) NOT NULL,
  `id_genre` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `products-genres`
--

INSERT INTO `products-genres` (`id`, `id_product`, `id_genre`) VALUES
(1, 79, 6),
(2, 79, 1),
(3, 63, 1),
(4, 64, 3),
(5, 73, 2),
(6, 74, 4),
(7, 75, 4),
(8, 76, 1),
(9, 77, 5),
(10, 78, 6),
(11, 63, 7),
(12, 78, 7),
(13, 80, 6);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(12) NOT NULL,
  `image` varchar(255) NOT NULL,
  `updated_at` datetime NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `role`, `image`, `updated_at`, `created_at`) VALUES
(39, 'egor8765', 'Egor9943@yandex.ru', '$2y$10$IQzn7zmqgZswMybOM1eXA.iOfZyUZ4dOF6yOYV05h.vJ2r.E4Dl9K', 'user', 'Bl-iHASDuDU.jpg', '2022-06-02 15:49:39', '2022-06-02 15:49:14');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `book_id` (`product_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `genres`
--
ALTER TABLE `genres`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_product_order_user` (`user_id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products-genres`
--
ALTER TABLE `products-genres`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_product` (`id_product`),
  ADD KEY `id_genre` (`id_genre`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `name` (`name`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=99;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT для таблицы `products-genres`
--
ALTER TABLE `products-genres`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `comments_ibfk_3` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `products-genres`
--
ALTER TABLE `products-genres`
  ADD CONSTRAINT `products-genres_ibfk_1` FOREIGN KEY (`id_product`) REFERENCES `products` (`id`) ON UPDATE CASCADE,
  ADD CONSTRAINT `products-genres_ibfk_2` FOREIGN KEY (`id_genre`) REFERENCES `genres` (`id`) ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
